# Parameter Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterValueProvider..::..Parameter Property
ParameterValueProvider Class See Also
---
The parameter used to provide a string, integer, double-precision, or ElementId value on request for a given element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public ElementId Parameter { get; set; }
```

Visual Basic
---
```text
Public Property Parameter As ElementId
	Get
	Set
```

Visual C++
---
```text
public:
property ElementId^ Parameter {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
ParameterValueProvider Class
Autodesk.Revit.DB Namespace